Revit 2027 API
ScheduleDefinition.ShowGrandTotalTitle Property
 Indicates if the grand total row should display a title.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGrandTotalTitle { get; set; }
Public Property ShowGrandTotalTitle As Boolean
	Get
	Set
public:
property bool ShowGrandTotalTitle {
	bool get ();
	void set (bool value);
}
member ShowGrandTotalTitle : bool with get, set
Property Value
Boolean
 True if a title should be displayed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: Display of a grand total row is not enabled.
Remarks
The title consists of the text "Grand total".
ShowGrandTotalTitle can only be enabled if ShowGrandTotal is enabled.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace